; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	spectrograph4 - mode
	infrared1 - mode
	image2 - mode
	image5 - mode
	image3 - mode
	infrared0 - mode
	GroundStation1 - direction
	Star4 - direction
	Star5 - direction
	Star3 - direction
	Star2 - direction
	GroundStation0 - direction
	Planet6 - direction
	Planet7 - direction
	Star8 - direction
	Star9 - direction
	Planet10 - direction
	Planet11 - direction
	Planet12 - direction
	Star13 - direction
)
(:init
	(supports instrument0 image3)
	(supports instrument0 infrared0)
	(supports instrument0 spectrograph4)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 Star5)
	(supports instrument1 infrared1)
	(supports instrument1 image5)
	(calibration_target instrument1 Star2)
	(calibration_target instrument1 Star3)
	(supports instrument2 image2)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
)
(:goal (and
	(have_image Planet6 spectrograph4)
	(have_image Planet6 image5)
	(have_image Planet7 infrared1)
	(have_image Star8 spectrograph4)
	(have_image Star8 infrared1)
	(have_image Star9 image5)
	(have_image Planet10 infrared0)
	(have_image Planet10 image2)
	(have_image Planet11 infrared0)
	(have_image Planet12 image2)
	(have_image Planet12 image3)
	(have_image Star13 image2)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 12
2. (calibrate satellite0 instrument1 star3)
   added: (calibrated instrument1)
   goals met: 0 of 12
3. (turn_to satellite0 star9 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star9)
   goals met: 0 of 12
4. (take_image satellite0 star9 instrument1 image5)
   added: (have_image star9 image5)
   goals met: 1 of 12
5. (turn_to satellite0 star8 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star8)
   goals met: 1 of 12
6. (take_image satellite0 star8 instrument1 infrared1)
   added: (have_image star8 infrared1)
   goals met: 2 of 12
7. (turn_to satellite0 planet7 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 planet7)
   goals met: 2 of 12
8. (take_image satellite0 planet7 instrument1 infrared1)
   added: (have_image planet7 infrared1)
   goals met: 3 of 12
9. (turn_to satellite0 planet6 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet6)
   goals met: 3 of 12
10. (take_image satellite0 planet6 instrument1 image5)
   added: (have_image planet6 image5)
   goals met: 4 of 12
11. (turn_to satellite0 groundstation0 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 groundstation0)
   goals met: 4 of 12
12. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 4 of 12
13. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 4 of 12
14. (calibrate satellite0 instrument2 groundstation0)
   added: (calibrated instrument2)
   goals met: 4 of 12
15. (turn_to satellite0 planet10 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet10)
   goals met: 4 of 12
16. (take_image satellite0 planet10 instrument2 image2)
   added: (have_image planet10 image2)
   goals met: 5 of 12
17. (turn_to satellite0 planet12 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet12)
   goals met: 5 of 12
18. (take_image satellite0 planet12 instrument2 image2)
   added: (have_image planet12 image2)
   goals met: 6 of 12
19. (turn_to satellite0 star13 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 star13)
   goals met: 6 of 12
20. (take_image satellite0 star13 instrument2 image2)
   added: (have_image star13 image2)
   goals met: 7 of 12
21. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 7 of 12
22. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 7 of 12
23. (turn_to satellite0 star2 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star2)
   goals met: 7 of 12
24. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 7 of 12
25. (turn_to satellite0 planet10 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet10)
   goals met: 7 of 12
26. (take_image satellite0 planet10 instrument0 infrared0)
   added: (have_image planet10 infrared0)
   goals met: 8 of 12
27. (turn_to satellite0 planet11 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet11)
   goals met: 8 of 12
28. (take_image satellite0 planet11 instrument0 infrared0)
   added: (have_image planet11 infrared0)
   goals met: 9 of 12
29. (turn_to satellite0 planet12 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet12)
   goals met: 9 of 12
30. (take_image satellite0 planet12 instrument0 image3)
   added: (have_image planet12 image3)
   goals met: 10 of 12
31. (turn_to satellite0 planet6 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet6)
   goals met: 10 of 12
32. (take_image satellite0 planet6 instrument0 spectrograph4)
   added: (have_image planet6 spectrograph4)
   goals met: 11 of 12
33. (turn_to satellite0 star8 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star8)
   goals met: 11 of 12
34. (take_image satellite0 star8 instrument0 spectrograph4)
   added: (have_image star8 spectrograph4)
   goals met: 12 of 12
